// https://nuxt.com/docs/api/configuration/nuxt-config
export default defineNuxtConfig({
  ssr:false,
  devtools:{enabled:true},
  modules: ['@element-plus/nuxt'],

  css: [
    'element-plus/dist/index.css',
    'element-plus/theme-chalk/display.css',
    '@/assets/css/main.css',
  ],app: {
    head: {
      viewport: 'width=device-width, initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no',
    }
  },nitro: {
    devProxy:{
      '/server':{
        target:'https://app-v1.ecoliving168.com/api/v1',
        changeOrigin:true
      }
    },
    // 该配置用于服务端请求转发
    routeRules: {
      '/server/**': {
        proxy: 'https://app-v1.ecoliving168.com/api/v1/**'
        // proxy: 'http://api.yinchunyu.com/**'
      }
    }
  },
  runtimeConfig:{
    isServer:"true",
    apiSecrect:"",
    public:{
        baseUrl:'/server/',
        // baseUrl:'/server/',
        navigation:JSON.parse('{"msg":"获取成功","data":{"index_top_nav":[{"id":0,"name":"推荐"},{"id":1,"name":"电影"},{"id":2,"name":"剧集"},{"id":3,"name":"综艺"},{"id":4,"name":"动漫"},{"id":36,"name":"爽剧"},{"id":26,"name":"福利"}],"movie_screen":{"filter":[{"id":1,"name":"电影","class":["类型","Netflix","剧情","科幻","动作","喜剧","爱情","冒险","儿童","歌舞","音乐","奇幻","动画","恐怖","惊悚","战争","传记","纪录","犯罪","悬疑","西部","灾难","古装","武侠","家庭","短片","校园","文艺","运动","青春","同性","励志","历史"],"area":["地区","大陆","香港","台湾","美国","日本","韩国","英国","法国","德国","印度","泰国","丹麦","瑞典","巴西","加拿大","俄罗斯","意大利","比利时","爱尔兰","西班牙","澳大利亚","其它"],"year":["年份","2024","2023","2022","2021","2020","10年代","00年代","90年代","80年代","更早"]},{"id":2,"name":"剧集","class":["类型","Netflix","欧美","短剧","古装","武侠","励志","家庭","剧情","喜剧","战争","科幻","惊悚","恐怖","悬疑","犯罪","动作","冒险","历史","同性"],"area":["地区","大陆","香港","韩国","美国","日本","法国","英国","德国","台湾","泰国","印度","其他"],"year":["年份","2024","2023","2022","2021","2020","10年代","00年代","90年代","80年代","更早"]},{"id":3,"name":"综艺","class":["类型","Netflix","脱口秀","真人秀","选秀","八卦","访谈","情感","生活","晚会","搞笑","音乐","时尚","游戏","少儿","体育","纪实","科教","曲艺","歌舞","财经","汽车","播报"],"area":["地区","大陆","韩国","香港","台湾","美国","其它"],"year":["年份","2024","2023","2022","2021","2020","10年代","00年代","90年代","80年代","更早"]},{"id":4,"name":"动漫","class":["类型","Netflix","欧美","国产","热血","科幻","美少女","魔幻","经典","励志","少儿","冒险","搞笑","推理","恋爱","治愈","幻想","校园","动物","机战","亲子","儿歌","运动","悬疑","怪物","战争","益智","青春","童话","竞技","动作","社会","友情"],"area":["地区","大陆","日本","欧美","其它"],"year":["年份","2024","2023","2022","2021","2020","10年代","00年代","90年代","80年代","更早"]},{"id":36,"name":"爽剧","class":["类型","古代","现代","穿越","玄幻","霸总","英雄救美","未婚妻","师姐","绝美","逆袭","美女","爱情","甜宠","虐恋","爽剧","搞笑","情感","动漫","萌宝","都市","言情","重生","乡村","神医","幻想","反转","复仇","修仙","古装","男频"],"area":["地区","大陆","香港","韩国","美国","日本","法国","英国","德国","台湾","泰国","印度","其他"],"year":["年份","2024","2023","2022","2021","2020","10年代","00年代","90年代","80年代","更早"]},{"id":26,"name":"福利","class":["类型","剧情","科幻","情色","动作","喜剧","爱情","冒险","奇幻","动画","恐怖","惊悚","战争","伦理","纪录","犯罪","悬疑","同性","灾难","家庭","短片","校园","青春"],"area":["地区","大陆","香港","台湾","美国","日本","韩国","英国","法国","德国","印度","泰国","丹麦","瑞典","巴西","加拿大","俄罗斯","意大利","比利时","爱尔兰","西班牙","澳大利亚","菲律宾","其它"],"year":["年份","2024","2023","2022","2021","2020","10年代","00年代","90年代","80年代","更早"]}],"sort":[{"name":"综合","value":"by_default"},{"name":"最新","value":"by_time"},{"name":"最热","value":"by_hits"},{"name":"评分","value":"by_score"}]},"movie_search_screen":{"res_type":[{"name":"按影片名称","value":"by_movie_name"},{"name":"按演员姓名","value":"by_actor_name"}],"type":[{"id":0,"name":"类型"},{"id":1,"name":"电影"},{"id":2,"name":"剧集"},{"id":3,"name":"综艺"},{"id":4,"name":"动漫"},{"id":36,"name":"爽剧"},{"id":26,"name":"福利"}],"sort":[{"name":"综合","value":"by_default"},{"name":"最新","value":"by_time"},{"name":"最热","value":"by_hits"},{"name":"评分","value":"by_score"}]},"new_notice":"12","feedback":[{"name":"播放问题","value":1000},{"name":"集数不全","value":1001},{"name":"资源缺失","value":1002},{"name":"信息有误","value":1003},{"name":"积分兑换","value":1004},{"name":"BUG反馈","value":1005}],"about":[{"text":"TG交流群","link":"https://t.me/+FHSplxcimaoyMzA1"},{"text":"反馈邮箱","link":"dianyinglieshou@gmail.com"},{"text":"官网下载","link":"https://dyls.site/"}],"start_countdown":3}}')
    }
  },
  compatibilityDate: '2024-04-03'
})
